# LayoutRuleMaximumSpacing Class

---
This class indicate the layout rule of a Beam System is Max-Spacing.
SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBLayoutRule Autodesk.Revit.DBLayoutRuleMaximumSpacing
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class LayoutRuleMaximumSpacing : LayoutRule

    Public Class LayoutRuleMaximumSpacing
    	Inherits LayoutRule

    public ref class LayoutRuleMaximumSpacing : public LayoutRule

    type LayoutRuleMaximumSpacing =
        class
            inherit LayoutRule
        end
The LayoutRuleMaximumSpacing type exposes the following members.
| Name| Description
---|---|---
| LayoutRuleMaximumSpacing| Constructor of LayoutRuleMaximumSpacing.
Top
| Name| Description
---|---|---
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Spacing| Get or set the spacing of the beam system.
Top
| Name| Description
---|---|---
| Dispose| Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
To use this type of LayoutRule, only the maximum spacing must be set and it must be in (0, 30000).
#### Reference
Autodesk.Revit.DB Namespace